---
kind: enumMember
id: F:Autodesk.Revit.DB.ScheduleFilterType.IsNotAssociatedWithGlobalParameter
enum: Autodesk.Revit.DB.ScheduleFilterType
source: html/9b696f55-de40-8739-8cfb-decd51995cff.htm
---
# Autodesk.Revit.DB.ScheduleFilterType.IsNotAssociatedWithGlobalParameter

The field is not associated with a specified global parameter of a compatible type